tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/aws"
cask "amazon-ssm-agent"

brew "curl"
brew "base64"
brew "bash"
brew "bash-completion@2"
brew "readline" 
brew "coreutils"
brew "gnu-getopt"
brew "pstree"
brew "tree"
brew "perl"
brew "libffi"
brew "jq"
brew "psutils"
brew "openssl@3.0"
brew "shellcheck"
brew "zlib" 
brew "xz" 

brew "awscli@2" --link --overwrite 
brew "amazon-ssm-agent"
#tap "jckuester/tap"
#tap "versent/taps"
#tap "warrensbox/tap"

