tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"
brew "xz"
brew "python@3.10"
brew "python@3.9"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "dateutils"
brew "git"
brew "go"
brew "jq"
brew "zlib"
brew "mysql"
brew "mysql-client"
brew "perl"
brew "pip-tools"
brew "pipx"
brew "poetry"
brew "pstree"
brew "tmux"
brew "tree"
cask "git-credential-manager-core"
cask "session-manager-plugin"
