tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "syncdk/aws-session-manager-plugin"

brew "bash"
brew "coreutils"
brew "perl"
brew "jq"
brew "zlib" 
brew "xz" 
brew "tree"
brew "pstree"
brew "git"
brew "awscli@2" 
brew tap "syncdk/aws-session-manager-plugin"
brew tap microsoft/git
brew install --cask git-credential-manager-core

brew "psutils"
brew "curl"
brew "libffi"
brew "bash-completion@2"
brew "readline" 
brew "gnu-getopt"
brew "openssl@3"
brew "shellcheck"

#tap "jckuester/tap"
#tap "versent/taps"
#tap "warrensbox/tap"
